In [2]:
# Import Dependencies
import pandas as pd

In [8]:
# A gigantic DataFrame of individuals' names, their trainers, their weight, and their days as gym members
gym_dict = {'Name': ['Gino Walker','Hiedi Wasser','Kerrie Wetzel'], 'Trainer': ['Bettyann Savory', 'Mariah Barberio', 'Gordon Perrine']}
gym_database = pd.DataFrame(gym_dict)
gym_database

            Name          Trainer
0    Gino Walker  Bettyann Savory
1   Hiedi Wasser  Mariah Barberio
2  Kerrie Wetzel   Gordon Perrine

In [10]:
# Collecting a list of all columns within the DataFrame
gym_database.columns

Index(['Name', 'Trainer'], dtype='object')

In [18]:
# Reorganizing the columns using double brackets
new_gym_database = gym_database[["Trainer", "Name"]] 
print(new_gym_database)
print(gym_database)
new_gym_database

           Trainer           Name
0  Bettyann Savory    Gino Walker
1  Mariah Barberio   Hiedi Wasser
2   Gordon Perrine  Kerrie Wetzel
            Name          Trainer
0    Gino Walker  Bettyann Savory
1   Hiedi Wasser  Mariah Barberio
2  Kerrie Wetzel   Gordon Perrine

           Trainer           Name
0  Bettyann Savory    Gino Walker
1  Mariah Barberio   Hiedi Wasser
2   Gordon Perrine  Kerrie Wetzel

In [22]:
# Using .rename(columns={}) in order to rename columns
gym_database.rename(columns={"Name":"Title","Trainer":"Instructor"})

           Title       Instructor
0    Gino Walker  Bettyann Savory
1   Hiedi Wasser  Mariah Barberio
2  Kerrie Wetzel   Gordon Perrine